//--------------------------------------------------------------------------------------
// File: GameOverScene.h
//
//--------------------------------------------------------------------------------------
#pragma once


// クラスの前方宣言
class Game;

// ゲームオーバーシーン
class GameOverScene
{

	// クラス定数の宣言 -------------------------------------------------
public:


	// データメンバの宣言 -----------------------------------------------
private:

	// このシーンを含むゲームオブジェクトへのポインタ
	Game* m_pGame;



	// メンバ関数の宣言 -------------------------------------------------
public:

	// コンストラクタ
	GameOverScene(Game* pGame);

	// デストラクタ
	~GameOverScene();

	// 初期化処理
	void Initialize();

	// 更新処理
	void Update(int keyCondition, int keyTrigger);

	// 描画処理
	void Render();

	// 終了処理
	void Finalize();

};
